## Terraform `plan`: 

<details><summary>Show output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # time_offset.example will be created
+ resource "time_offset" "example" {
+   base_rfc3339 = (known after apply)
+   day          = (known after apply)
+   hour         = (known after apply)
+   id           = (known after apply)
+   minute       = (known after apply)
+   month        = (known after apply)
+   offset_days  = 7
+   rfc3339      = (known after apply)
+   second       = (known after apply)
+   unix         = (known after apply)
+   year         = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ one_week_from_now = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
        
	💡 To plan: terraform plan -w dev -d terraform_test/time-1
	🚀 To apply: terraform apply -w dev -d terraform_test/time-1
	👀 To plan-destroy: terraform plan-destroy -w dev -d terraform_test/time-1
	💀 To apply-destroy: terraform apply-destroy -w dev -d terraform_test/time-1
	